# Pandas Library

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['col1','col2','col3','col4'])

In [3]:
df

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [4]:
pd.DataFrame.to_csv(df,'test1.csv')

In [5]:
df.to_csv('test2.csv')

In [6]:
## Accessing Element
## 1 . loc 2. iloc

In [7]:
df.loc['row2']

col1    4
col2    5
col3    6
col4    7
Name: row2, dtype: int32

In [8]:
type(df.loc['row1'])

pandas.core.series.Series

In [9]:
df.iloc[:,:]

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [10]:
df.iloc[0:2,0:2]

      col1  col2
row1     0     1
row2     4     5

In [11]:
type(df.iloc[:,:])

pandas.core.frame.DataFrame

In [12]:
df.iloc[0:1,0:1]

      col1
row1     0

In [13]:
type(df.iloc[0:2,0:1])

pandas.core.frame.DataFrame

In [14]:
type(df.iloc[0:1,0:1])

pandas.core.frame.DataFrame

In [15]:
df.iloc[0:2,0]

row1    0
row2    4
Name: col1, dtype: int32

In [16]:
type(df.iloc[0:2,0])

pandas.core.series.Series

In [17]:
df.iloc[:,1:]

      col2  col3  col4
row1     1     2     3
row2     5     6     7
row3     9    10    11
row4    13    14    15
row5    17    18    19

In [18]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [19]:
df.iloc[:,1:].values.shape

(5, 3)

In [20]:
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [21]:
df

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [22]:
df['col1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: col1, dtype: int64

In [23]:
df['col2'].unique()

array([ 1,  5,  9, 13, 17])

In [24]:
df['col3']

row1     2
row2     6
row3    10
row4    14
row5    18
Name: col3, dtype: int32

In [25]:
type(df['col3'])

pandas.core.series.Series

In [26]:
df[['col1','col3']]

      col1  col3
row1     0     2
row2     4     6
row3     8    10
row4    12    14
row5    16    18

# Reading Data

In [27]:
df = pd.read_excel('wheather_data.xlsx')

In [28]:
df.head()

        date  temperature  windspeed  event
0 2017-01-01           32          2   Rain
1 2017-01-02           35          3  Sunny
2 2017-01-03           45          9   Snow
3 2017-01-04           21          8   Snow
4 2017-01-05           28          7   Rain

In [29]:
df

        date  temperature  windspeed  event
0 2017-01-01           32          2   Rain
1 2017-01-02           35          3  Sunny
2 2017-01-03           45          9   Snow
3 2017-01-04           21          8   Snow
4 2017-01-05           28          7   Rain
5 2017-01-06           18          5  Sunny
6 2017-01-07           36          2   Snow

In [30]:
test_df = pd.read_csv('test1.csv',sep=';')

In [31]:
test_df

  ,col1,col2,col3,col4
0         row1,0,1,2,3
1         row2,4,5,6,7
2       row3,8,9,10,11
3     row4,12,13,14,15
4     row5,16,17,18,19

In [32]:
df = pd.read_csv('1000_Companies.csv')

In [33]:
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   R&D Spend        1000 non-null   float64
 1   Administration   1000 non-null   float64
 2   Marketing Spend  1000 non-null   float64
 3   State            1000 non-null   object
 4   Profit           1000 non-null   float64
dtypes: float64(4), object(1)
memory usage: 39.2+ KB

In [35]:
# object type will be not taken in consideration 
# ex -> state
df.describe()

           R&D Spend  Administration  Marketing Spend         Profit
count    1000.000000     1000.000000      1000.000000    1000.000000
mean    81668.927200   122963.897612    226205.058419  119546.164656
std     46537.567891    12613.927535     91578.393542   42888.633848
min         0.000000    51283.140000         0.000000   14681.400000
25%     43084.500000   116640.684850    150969.584600   85943.198543
50%     79936.000000   122421.612150    224517.887350  117641.466300
75%    124565.500000   129139.118000    308189.808525  155577.107425
max    165349.200000   321652.140000    471784.100000  476485.430000

In [36]:
df['Profit'].value_counts()

121248.71160    2
180257.17950    2
95178.30183     1
74425.00156     1
52731.98078     1
               ..
63373.88839     1
135506.83460    1
60111.34964     1
109658.54060    1
168285.14020    1
Name: Profit, Length: 998, dtype: int64

In [37]:
df[df['Marketing Spend']>300000]

     R&D Spend  Administration  Marketing Spend       State       Profit
0    165349.20     136897.8000      471784.1000    New York  192261.8300
1    162597.70     151377.5900      443898.5300  California  191792.0600
2    153441.51     101145.5500      407934.5400     Florida  191050.3900
3    144372.41     118671.8500      383199.6200    New York  182901.9900
4    142107.34      91391.7700      366168.4200     Florida  166187.9400
..         ...             ...              ...         ...          ...
975  140149.00     131154.9383      339196.9174     Florida  168760.9805
982  123537.00     128701.6025      307144.0180  California  154569.4922
990  136133.00     130561.8371      331448.0344  California  165330.1463
991  131106.00     129819.4269      321748.4242    New York  161035.6236
996  134970.00     130390.0800      329204.0228  California  164336.6055

[280 rows x 5 columns]

# CSV

In [38]:
from io import StringIO , BytesIO

In [39]:
data = ('col1,col2,col3\n'
           'x,y,4\n'
            'a,b,49\n'
            'p,q,15'
       )

In [40]:
type(data)

str

In [41]:
d= pd.read_csv(StringIO(data))
d

  col1 col2  col3
0    x    y     4
1    a    b    49
2    p    q    15

In [42]:
d.describe()

            col3
count   3.000000
mean   22.666667
std    23.459184
min     4.000000
25%     9.500000
50%    15.000000
75%    32.000000
max    49.000000

In [43]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      object
 1   col2    3 non-null      object
 2   col3    3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [44]:
data

'col1,col2,col3\nx,y,4\na,b,49\np,q,15'

In [45]:
## read from specific column
df = pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [46]:
df

  col1  col3
0    x     4
1    a    49
2    p    15

In [47]:
df.to_csv('test3.csv')

In [48]:
data = ('a,b,c,d\n'
        '1,2,3,90\n'
        '5,6,7,49\n'
        '9,10,11,194\n'
)

In [49]:
print(data)

a,b,c,d
1,2,3,90
5,6,7,49
9,10,11,194

In [50]:
df = pd.read_csv(StringIO(data),dtype=object)

In [51]:
df

   a   b   c    d
0  1   2   3   90
1  5   6   7   49
2  9  10  11  194

In [52]:
df['b']

0     2
1     6
2    10
Name: b, dtype: object

In [53]:
df['c'][2]

'11'

In [54]:
df = pd.read_csv(StringIO(data),dtype=int)

In [55]:
df

   a   b   c    d
0  1   2   3   90
1  5   6   7   49
2  9  10  11  194

In [56]:
type(df)

pandas.core.frame.DataFrame

In [57]:
df['d']

0     90
1     49
2    194
Name: d, dtype: int32

In [58]:
df = pd.read_csv(StringIO(data),dtype=float)

In [59]:
df

     a     b     c      d
0  1.0   2.0   3.0   90.0
1  5.0   6.0   7.0   49.0
2  9.0  10.0  11.0  194.0

In [60]:
df['a']

0    1.0
1    5.0
2    9.0
Name: a, dtype: float64

In [61]:
df = pd.read_csv(StringIO(data),dtype={'a':int,'b':np.int8,'c':np.float32})

In [62]:
df

   a   b     c    d
0  1   2   3.0   90
1  5   6   7.0   49
2  9  10  11.0  194

In [63]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int32

In [64]:
df['b']

0     2
1     6
2    10
Name: b, dtype: int8

In [65]:
df['c']

0     3.0
1     7.0
2    11.0
Name: c, dtype: float32

In [66]:
df.dtypes

a      int32
b       int8
c    float32
d      int64
dtype: object

In [67]:
data = ('index,a,b,c\n'
       '4,apple,bat,5.7\n'
        '6,banana,cat,6.4\n'
       )

In [68]:
pd.read_csv(StringIO(data),index_col=0)

            a    b    c
index
4       apple  bat  5.7
6      banana  cat  6.4

In [69]:
pd.read_csv(StringIO(data),index_col=2)

     index       a    c
b
bat      4   apple  5.7
cat      6  banana  6.4

In [70]:
data = ('a,b,c\n'
       '4,apple,bat\n'
        '6,banana,cat\n'
       )

In [71]:
pd.read_csv(StringIO(data))

   a       b    c
0  4   apple  bat
1  6  banana  cat

In [72]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  6  banana  cat

In [73]:
## combining usecols and index_col
data = ('a,b,c\n'
        '3,mango,cow'
        '5,strobary,goat'
)

In [74]:
pd.read_csv(StringIO(data),usecols=['b','c'],index_col=False)

       b     c
0  mango  cow5

In [75]:
data = 'a,b\n"hello,  \\"Bob\\"  ,nice to meet you",5'

In [76]:
pd.read_csv(StringIO(data),escapechar='\\')

                                  a  b
0  hello,  "Bob"  ,nice to meet you  5

In [77]:
df = pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')

URLError: <urlopen error [Errno 11001] getaddrinfo failed>

In [ ]:
df

In [ ]:
df.describe()

In [ ]:
df.head()

# Reading Json to CSV

In [ ]:
data = '{"emoplyee_name":"Utsav","email":"up1512001@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Sr. Developer"}]}'
df1=pd.read_json(data)

In [ ]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data')

In [ ]:
df

In [ ]:
df = pd.read_json('https://archive.ics.uci.edu/ml/machine-learning-databases/00410/reviews.json')
df

In [ ]:
# convert json to csv
df.to_csv('reviews.csv')

In [ ]:
df1.to_json()

In [ ]:
df1.to_json(orient='index')

In [ ]:
df1.to_json(orient='records')

In [ ]:
# convert json to different json formate
df.to_json(orient='records')

# Reading HTML content

In [79]:
url = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/index.html'

In [80]:
dfs = pd.read_html(url)

In [81]:
dfs[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [82]:
type(dfs)

list

In [83]:
url_mcc = 'https://en.wikipedia.org/wiki/Mobile_country_code'
dfs = pd.read_html(url_mcc,match='Country',header=0)

In [84]:
dfs[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [85]:
dfs[0].to_csv('country_code.csv')

In [86]:
dfs[0].to_json('country_code_json.json')

In [90]:
len(dfs)

1

In [91]:
dfs[0].to_html('country_code_html.html')